{
    "_id": {
        "$oid": "6655b6919ffa2ef7bad3ca7b"
    },

    "name": "Chiken Piccata Caserole",
    "time": 60,
    "difficulty": "HARD",
    "portions": 4,
    "picture": "chickenPiccata.png",
    "category": "Dinner",
    "description": "Great chicken dish for pepper lovers.",
    "ingredients": [
        {
            "name": "chicken",
            "quantity": 1,
            "measurement": "whole"
        },
        {
            "name": "lemon",
            "quantity": 2,
            "measurement": "sliced"
        },
        {
            "name": "garlic",
            "quantity": 6,
            "measurement": "cloves"
        },
        {
            "name": "olive oil",
            "quantity": 2,
            "measurement": "tbsp"
        },
        {
            "name": "dried thyme",
            "quantity": 1,
            "measurement": "tsp"
        },
        {
            "name": "dried rosemary",
            "quantity": 1,
            "measurement": "tsp"
        },
        {
            "name": "salt",
            "quantity": 2,
            "measurement": "tsp"
        },
        {
            "name": "pepper",
            "quantity": 1,
            "measurement": "tsp"
        }
    ],
    "instructions": [
        "This recipe goes beyond the basics, inviting you to savor the richness of a creamy tomato basil sauce that clings to each strand of perfectly cooked pasta. It's a celebration of simplicity, where every ingredient plays a crucial role in creating a dish that is as comforting as it is delightful. Allow the chicken to rest for 10 minutes before carving. This brief resting period is essential; it allows the juices to redistribute, ensuring each slice is succulent and bursting with flavor. As you carve into the golden exterior, be prepared for the enticing aroma that fills the air, signaling that your Citrus Infusion Delight is ready to be savored.",
        "Preheat your oven to 375°F (190°C).",
        "Rinse the chicken inside and out, then pat it dry with paper towels.",
        "Carefully lift the skin of the chicken and rub minced garlic directly onto the meat.",
        "Place lemon slices under the skin, ensuring they cover as much surface as possible.",
        "In a small bowl, mix olive oil, dried thyme, dried rosemary, salt, and black pepper to create a herb-infused mixture.",
        "Brush the entire chicken with the herb-infused mixture, making sure it's evenly coated.",
        "Season the exterior with additional salt and black pepper to taste.",
        "Place the chicken in a roasting pan, breast side up.",
        "Roast in the preheated oven for approximately 1 hour or until the internal temperature reaches 165°F (74°C).",
        "Allow the chicken to rest for 10 minutes before carving.",
        "Serve with the pan juices and roasted lemon slices for an extra burst of flavor.",
        "Side Dish: Serve alongside roasted vegetables or a simple green salad.",
        "Wine: Pair with a crisp white wine or a light rosé for a well-balanced meal.",
        "The combination of fresh lemon and aromatic garlic creates a citrus-infused masterpiece that takes the classic roast chicken to a whole new level. The acidity of the lemons not only adds brightness but also helps to tenderize the meat, resulting in a juicy and flavorful dish. Whether you're hosting a family dinner or looking for a show-stopping centerpiece for a special celebration, this Lemon Garlic Roasted Chicken is the answer. The simplicity of the ingredients allows the natural flavors to shine, making it a versatile and impressive dish."
    ],
    "status": "APPROVED",
    "rejectionReason": "",
    "rating": 4,
    "reportNo": 0,
    "userId": {
        "$oid": "6609753f120f5be65edec777"
    }

}
